In [1]:
import pandas as pd
import numpy as np

In [5]:
list = [1,2,3,4,5]
df1 = pd.DataFrame(list)
print(type(df1))
print(df1)

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5

In [6]:
df1['1열'] = list
df1

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [7]:
df1.columns

Index([0, '1열'], dtype='object')

In [8]:
df2 = df1.rename(columns={0:'0열'})
df2

   0열  1열
0   1   1
1   2   2
2   3   3
3   4   4
4   5   5

In [10]:
score = [
    ['정약용',70,80,100],
    ['이순신',90,80,60],
    ['이율곡',50,100,100]
]
print(type(score))
score

<class 'list'>

[['정약용', 70, 80, 100], ['이순신', 90, 80, 60], ['이율곡', 50, 100, 100]]

In [12]:
df3 = pd.DataFrame(score)
print(type(df3))
df3

<class 'pandas.core.frame.DataFrame'>

     0   1    2    3
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100

In [16]:
df3.columns = ["이름","국어","영어","수학"]
print(df3.shape)
print(df3)
print(df3.index)

(3, 4)
    이름  국어   영어   수학
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100
RangeIndex(start=0, stop=3, step=1)

In [17]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [18]:
df3.describe()

         국어          영어          수학
count   3.0    3.000000    3.000000
mean   70.0   86.666667   86.666667
std    20.0   11.547005   23.094011
min    50.0   80.000000   60.000000
25%    60.0   80.000000   80.000000
50%    70.0   80.000000  100.000000
75%    80.0   90.000000  100.000000
max    90.0  100.000000  100.000000

In [ ]:
# dic1 = {
#     'col1':[1,2,3,4],
#     'col2':[5,6,7,8]
# }

n = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[5,6,7,8]
})
print(n)

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8